In [4]:
import pandas as pd
import numpy as np
import os

## Concatenating Data.

### creating dictionaries from the data for the months of january

In [1]:
data1 = {'customer_id':['6732', '767', '890', '635'],
    'month':['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
    'purchased_meat':[0, 13, 3, 4],
    'purchased_alcohol':[1, 2, 10, 0],
    'purchased_snacks':[10, 5, 1, 7]}

### creating dictionaries from the data for the months of february

In [2]:
data2 = {'customer_id':['6732', '767', '890', '635'],
    'month':['Feb-20', 'Feb-20', 'Feb-20', 'Feb-20'],
    'purchased_meat':[0, 10, 5, 3],
    'purchased_alcohol':[2, 4, 14, 0],
    'purchased_snacks':[15, 3, 2, 6]}

### convert the dictionaries into dataframes by using pd.DataFrame function and index argument.

In [5]:
df = pd.DataFrame(data1,index=[0, 1, 2, 3])
df_1 = pd.DataFrame(data2,index=[0, 1, 2, 3])

In [6]:
df

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7

In [7]:
df_1

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

### Create a list- Frames(df and df_1). then concatenate this list with the pandas function pd.concat(), and then saving the results in new dataframe-  df_concat      (long way) vertically

In [8]:
frames = [df, df_1]
df_concat = pd.concat(frames)

In [9]:
df_concat

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

### now if you want to present dataframe in wide way or horizontally, just need to add axis=1

In [10]:
frames = [df, df_1]
df_concat = pd.concat(frames, axis=1)

In [11]:
df_concat

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks
0,6732,Jan-20,0,1,10,6732,Feb-20,0,2,15
1,767,Jan-20,13,2,5,767,Feb-20,10,4,3
2,890,Jan-20,3,10,1,890,Feb-20,5,14,2
3,635,Jan-20,4,0,7,635,Feb-20,3,0,6

## Joining Data

### we will usedf.merge() function. ( same like SQL join operators). lets create another Dataframe df_2

In [12]:
data3 = {'customer_id':['6732', '767', '890', '635'],
    'month':['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
    'days_purchased_on':[0, 10, 4, 1]}

df_2 = pd.DataFrame(data3,index=[0, 1, 2, 3])

In [13]:
df_2

  customer_id   month  days_purchased_on
0        6732  Jan-20                  0
1         767  Jan-20                 10
2         890  Jan-20                  4
3         635  Jan-20                  1

### we want to merge two dataframes df and df_2 by using df.merge() function. and set the on argument to pivot around a common column 'customer_id'

In [14]:
df_merged = df.merge(df_2, on = 'customer_id')

In [15]:
df_merged

,customer_id,month_x,purchased_meat,purchased_alcohol,purchased_snacks,month_y,days_purchased_on
0,6732,Jan-20,0,1,10,Jan-20,0
1,767,Jan-20,13,2,5,Jan-20,10
2,890,Jan-20,3,10,1,Jan-20,4
3,635,Jan-20,4,0,7,Jan-20,1

### above we noticed that the additional of the on=customer_id column tells pandas that the customer_id column is the common column between the two. the result is a wide format dataframe with all the information from both dataframes and most importantly, no rows with missing values.

### now we know that months are same so how merged it? more then one parameter so using [ ]

In [16]:
df_merged = df.merge(df_2, on = ['customer_id', 'month'])

In [17]:
df_merged

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on
0,6732,Jan-20,0,1,10,0
1,767,Jan-20,13,2,5,10
2,890,Jan-20,3,10,1,4
3,635,Jan-20,4,0,7,1

### A quick and easy way to check for a full match is via the indicator=True argument.It creates additional column.if you find 'both' means key exists in both dataframes. while value of left_only or right_only indicates that the key only exists in either the left or right dataframe.  If every row within the dataframes returns a value of 'both' it means you have full match between your dataframes.

In [18]:
df_merged = df.merge(df_2, on = ['customer_id', 'month'], indicator = True)

In [19]:
df_merged

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on,_merge
0,6732,Jan-20,0,1,10,0,both
1,767,Jan-20,13,2,5,10,both
2,890,Jan-20,3,10,1,4,both
3,635,Jan-20,4,0,7,1,both

### you can check frequency on this column, you will quickly able to see how many rows in the new dataframe have a value of both, right_only and left_only.

In [20]:
df_merged['_merge']. value_counts()

_merge
both          4
left_only     0
right_only    0
Name: count, dtype: int64

###using 'how' argument. how you want tthe dataframes to be merged and it can tajke the values left, right, inner or outer.Inner join is used to keep only information that is present in both datasets.

In [21]:
df.merge(df_2, on = ['customer_id', 'month'], how = 'inner')

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on
0,6732,Jan-20,0,1,10,0
1,767,Jan-20,13,2,5,10
2,890,Jan-20,3,10,1,4
3,635,Jan-20,4,0,7,1